interThermalPhaseFoam/tutorials/NusseltSmGF/0/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9000
(
1
1
1
1
1
1
0
0
...
)
;

boundaryField
{
    Inlet
    {
        type            groovyBC;
        refValue        uniform 0;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        value           uniform 0;
        valueExpression "pos().x<h_in ? 1 : 0";
        gradientExpression "0";
        fractionExpression "1";
        evaluateDuringConstruction 0;
        variables       "";
        timelines       (
);
        lookuptables    (
);
        globalScopes    1(globalVars)
;
    }
    BotOutlet1
    {
        type            zeroGradient;
    }
    BotOutlet2
    {
        type            zeroGradient;
    }
    TopInlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    FreeStream
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    FrontNBack
    {
        type            empty;
    }
    LeftSide
    {
        type            constantAlphaContactAngle;
        gradient        uniform 0;
        limit           gradient;
        theta0          20;
        value           uniform 1;
    }
}


// ************************************************************************* //
