interThermalPhaseFoam/tutorials/NusseltSmGF/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

vertices        
(
//First Block
	//Back face
	(0        0        0)           //00
	(0.0066329     0        0)           //01
	(0.0066329     0.8      0)           //02
	(0        0.8      0)           //03
	//Front face
	(0        0         0.005)      //04
	(0.0066329      0         0.005)      //05
	(0.0066329      0.8       0.005)      //06
	(0        0.8       0.005)      //07
//Second Block
        //Back face
	(0.0066329      0          0)           //08
	(0.02     0          0)           //09
	(0.02     0.8        0)           //10
	(0.0066329      0.8        0)           //11
	//Front face
	(0.0066329      0          0.005)      //12
	(0.02     0          0.005)      //13
	(0.02     0.8        0.005)      //14
	(0.0066329      0.8        0.005)      //15
//Third Block (Bigger One)
        //Back face
	(0.02     0          0)           //16
	(0.10     0          0)           //17
	(0.10     0.8        0)           //18
	(0.02     0.8        0)           //19
	//Front face
	(0.02    0          0.005)       //20
	(0.10    0          0.005)       //21
	(0.10    0.8        0.005)       //22
	(0.02    0.8        0.005)       //23
);

blocks          
(
	hex ( 0  1  2  3  4  5  6  7) (20 100 1) simpleGrading (1 1 1)	//00
	hex ( 1  9 10  2  5 13 14  6) (40 100 1) simpleGrading (1 1 1)	//01
	hex ( 9  17 18 10 13 21 22 14)(30 100 1) simpleGrading (3 1 1)	//02
);

edges           
(
);

boundary         
(
	Inlet
	{
		type     patch;
		faces
		(
			( 2  3  7  6)
		);
	}

	BotOutlet1
	{
		type     patch;
		faces
		(
			( 0  1  5  4)
		);
	}

	BotOutlet2
	{
		type     patch;
		faces
		(
                        ( 1  9 13  5)
                        ( 9 17 21 13)
		);
	}

       TopInlet
	{
		type     patch;
		faces
		(
                        (10 2 6 14)
			(18 10 14 22)
		);
	}

	FreeStream
	{
		type     patch;
		faces
		(
			(17 18 22 21)
		);
	}

	FrontNBack
	{
		type     empty;
		faces		
		(
			( 0  3  2  1)
			( 4  5  6  7)
                        (1 2 10 9)
                        (5 13 14 6)
                        (9 10 18 17)
                        (13 21 22 14)
		);
	}

	LeftSide
	{
		type     wall;
		faces
		(
			( 0  4  7  3)
		);
	}

);

mergePatchPairs 
();

// ************************************************************************* //
